{"data":{"site":{"siteMetadata":{"title":"Johnny Zhu"}},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"Built with  React . A discovery app for local restaurant information and reviews, modeled after Yelp.  The project was an exercise in…","fields":{"slug":"/welp/"},"frontmatter":{"date":"May 30, 2018","title":"Welp","subtitle":"Component Design Within a Microservices Architecture","excerpt":"Built with React. Local restaurant reviews and information, modeled after Yelp. Components that display restaurant information, hours, and menu items. Implements a RESTful API on the backend."}}},{"node":{"excerpt":"On a recent project, I led the optimization and development of the backend architecture for a crowfunding application.\nThe two main goals of…","fields":{"slug":"/jumpstarter/"},"frontmatter":{"date":"May 29, 2018","title":"Jumpstarter","subtitle":"Optimizing Backend Architecture for Scale","excerpt":"Crowdfunding platform modeled after Kickstarter. Designed for scale, handling 7K requests/second. Utilizes server-side rendering and other techniques to achieve 2x page loads speeds."}}},{"node":{"excerpt":"Predicts events of interest based on user inputted star ratings by building a simple neural network in the browser. Recommendation engine…","fields":{"slug":"/eventright/"},"frontmatter":{"date":"May 28, 2018","title":"Eventright","subtitle":"Personalized Live Event Recommendations","excerpt":"Predicts events of interest based on user inputted star ratings by building a simple neural network in the browser. Recommendation engine built with Brain.js.  View is rendered as a single page app with map and event list components."}}},{"node":{"excerpt":"","fields":{"slug":"/aws-iot-button/"},"frontmatter":{"date":"April 18, 2017","title":"AWS IoT Button","subtitle":"When Did I Wakeup?","excerpt":"A small project to familiarize myself with AWS IoT Services. Each morning when I press a physical Amazon Dash button it records the data in DynamoDB and displays it on a line graph using Chart.js. See how it helped improve my morning routine!"}}},{"node":{"excerpt":"For this project we analyzed data from the  World Bank logistics performance index . The primary questions we wanted to answer were: What’s…","fields":{"slug":"/wheres-my-widget/"},"frontmatter":{"date":"May 02, 2016","title":"Visualizing World Bank Logistics Data","subtitle":null,"excerpt":"A team of us worked together to build a visualization using D3.js to understand trade logistics around the world. We created a choropleth map, radar charts, and a vertical bar chart filterable using dropdowns and sliders."}}}]}},"pageContext":{}}